# Pandas introduction

In [1]:
import numpy as np
import pandas as pd

In [2]:
indices = ['a','b','c']
my_list = [10,20, 11]

dictionry_list = {'a':10,'b':20,'c':11}

In [4]:
pd.Series(data = my_list)

0    10
1    20
2    11
dtype: int64

In [5]:
x = pd.Series(data = my_list, index = indices)
x['a']

10

In [7]:
pd.Series(dictionry_list)

a    10
b    20
c    11
dtype: int64

In [8]:
# operation

In [9]:
ser1 = pd.Series([1,2,3,4],index = ['USA', 'Germany','USSR', 'Japan'])
ser2 = pd.Series([1,2,5,4],index = ['USA', 'Germany','Italy', 'Japan'])

In [12]:
print(type(ser1))

<class 'pandas.core.series.Series'>

In [10]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [16]:
'A B C D E'.split()

['A', 'B', 'C', 'D', 'E']

In [17]:
'W X Y Z'.split()

['W', 'X', 'Y', 'Z']

In [18]:
from numpy.random import uniform

In [36]:
a = uniform(0,1,(5,4))
b = uniform(0,1,(5,4))

In [38]:
type(a)

numpy.ndarray

In [37]:
a.shape

(5, 4)

In [39]:
a+b

array([[0.88711097, 0.57916429, 0.63308841, 1.18175913],
       [1.05759021, 0.3426132 , 1.61670591, 0.45201788],
       [0.96244244, 1.21915157, 1.19429026, 0.56969694],
       [0.88483969, 1.03088326, 1.57042847, 0.74305704],
       [0.88577342, 1.22405982, 0.3858907 , 0.92790889]])

In [40]:
'A B C D E'.split()

['A', 'B', 'C', 'D', 'E']

In [41]:
'W X Y Z'.split()

['W', 'X', 'Y', 'Z']

In [93]:
data = uniform(0,1,(5,4)).astype(np.float32)

In [60]:
data.shape

(5, 4)

In [61]:
data.dtype

dtype('float32')

In [62]:
data = data*1

In [143]:
df = pd.DataFrame(data = data,
                  index = ['A', 'B', 'C', 'D', 'E'],
                  columns=['W', 'X', 'Y', 'Z'])

In [144]:
df

          W         X         Y         Z
A  0.860067  0.663405  0.233360  0.932656
B  0.508096  0.701198  0.179704  0.451056
C  0.655057  0.687329  0.836470  0.323608
D  0.019903  0.454999  0.006563  0.587017
E  0.764616  0.934777  0.621007  0.675421

In [105]:
tex_form = df.to_latex()

In [68]:
df['W']

A    0.656752
B    0.107083
C    0.816892
D    0.339255
E    0.800467
Name: W, dtype: float32

In [69]:
df.W

A    0.656752
B    0.107083
C    0.816892
D    0.339255
E    0.800467
Name: W, dtype: float32

In [70]:
type(df['W'])

pandas.core.series.Series

In [71]:
df[['W','Z']]

          W         Z
A  0.656752  0.426732
B  0.107083  0.761147
C  0.816892  0.638923
D  0.339255  0.919178
E  0.800467  0.779311

In [103]:
df['NEW'] = df['W'] + df['Y']
df

          W         X         Y         Z       NEW
A  0.860067  0.663405  0.233360  0.932656  1.093428
B  0.508096  0.701198  0.179704  0.451056  0.687800
C  0.655057  0.687329  0.836470  0.323608  1.491528
D  0.019903  0.454999  0.006563  0.587017  0.026467
E  0.764616  0.934777  0.621007  0.675421  1.385623

In [75]:
df['W'] = df['W']/np.sum(df['W'])

In [101]:
df.drop('A',axis=0)

          W         X         Y         Z
B  0.508096  0.701198  0.179704  0.451056
C  0.655057  0.687329  0.836470  0.323608
D  0.019903  0.454999  0.006563  0.587017
E  0.764616  0.934777  0.621007  0.675421

In [104]:
df.drop('NEW',axis=1)

          W         X         Y         Z
A  0.860067  0.663405  0.233360  0.932656
B  0.508096  0.701198  0.179704  0.451056
C  0.655057  0.687329  0.836470  0.323608
D  0.019903  0.454999  0.006563  0.587017
E  0.764616  0.934777  0.621007  0.675421

In [84]:
df

          W         X         Y         Z       NEW
A  0.241413  0.515399  0.914911  0.426732  1.571663
B  0.039362  0.575491  0.592900  0.761147  0.699983
C  0.300278  0.579161  0.840861  0.638923  1.657753
D  0.124705  0.239863  0.374937  0.919178  0.714191
E  0.294241  0.952841  0.654556  0.779311  1.455023

In [85]:
df.loc['A']

W      0.241413
X      0.515399
Y      0.914911
Z      0.426732
NEW    1.571663
Name: A, dtype: float32

In [86]:
df.iloc[2]

W      0.300278
X      0.579161
Y      0.840861
Z      0.638923
NEW    1.657753
Name: C, dtype: float32

In [87]:
df.loc['B','Y']

0.5928999

In [88]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.241413  0.914911
B  0.039362  0.592900

In [98]:
df.loc[:,'Y']

A    0.233360
B    0.179704
C    0.836470
D    0.006563
E    0.621007
Name: Y, dtype: float32

In [89]:
df>0.5

       W      X      Y      Z   NEW
A  False   True   True  False  True
B  False   True   True   True  True
C  False   True   True   True  True
D  False  False  False   True  True
E  False   True   True   True  True

In [90]:
df[df>0.5]

    W         X         Y         Z       NEW
A NaN  0.515399  0.914911       NaN  1.571663
B NaN  0.575491  0.592900  0.761147  0.699983
C NaN  0.579161  0.840861  0.638923  1.657753
D NaN       NaN       NaN  0.919178  0.714191
E NaN  0.952841  0.654556  0.779311  1.455023

In [95]:
df[df['W']>df['Y']]

          W         X         Y         Z
A  0.860067  0.663405  0.233360  0.932656
B  0.508096  0.701198  0.179704  0.451056
D  0.019903  0.454999  0.006563  0.587017
E  0.764616  0.934777  0.621007  0.675421

In [96]:
df[(df['W']>0.1) & (df['Y'] > 0.7)]

          W         X        Y         Z
C  0.655057  0.687329  0.83647  0.323608

In [97]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.860067  0.663405  0.233360  0.932656
1     B  0.508096  0.701198  0.179704  0.451056
2     C  0.655057  0.687329  0.836470  0.323608
3     D  0.019903  0.454999  0.006563  0.587017
4     E  0.764616  0.934777  0.621007  0.675421

In [145]:
newind = 'CA NY WY OR CO'.split()
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [147]:
df['States'] = newind
df

          W         X         Y         Z States
A  0.860067  0.663405  0.233360  0.932656     CA
B  0.508096  0.701198  0.179704  0.451056     NY
C  0.655057  0.687329  0.836470  0.323608     WY
D  0.019903  0.454999  0.006563  0.587017     OR
E  0.764616  0.934777  0.621007  0.675421     CO

In [148]:
df.set_index('States')

               W         X         Y         Z
States
CA      0.860067  0.663405  0.233360  0.932656
NY      0.508096  0.701198  0.179704  0.451056
WY      0.655057  0.687329  0.836470  0.323608
OR      0.019903  0.454999  0.006563  0.587017
CO      0.764616  0.934777  0.621007  0.675421

In [149]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [150]:
df['col2'].unique()

array([444, 555, 666])

In [151]:
df['col2'].nunique()

3

In [152]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [153]:
def times2(x):
    return 2*x

In [154]:
df['col2'] = df['col2'].apply(times2)
df

   col1  col2 col3
0     1   888  abc
1     2  1110  def
2     3  1332  ghi
3     4   888  xyz

In [155]:
fun = lambda x:x*2

In [156]:
fun(3)

6

In [157]:
df['col2'] = df['col2'].apply(lambda x:x*2)
df

   col1  col2 col3
0     1  1776  abc
1     2  2220  def
2     3  2664  ghi
3     4  1776  xyz

In [158]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [159]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [160]:
df.sort_values(by='col2') #inplace=False by default

   col1  col2 col3
0     1  1776  abc
3     4  1776  xyz
1     2  2220  def
2     3  2664  ghi

In [161]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [162]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head(2)

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def

In [163]:
df.isnull()

    col1   col2   col3
0  False   True  False
1  False  False  False
2  False  False  False
3   True  False  False

In [164]:
df.dropna()

   col1   col2 col3
1   2.0  555.0  def
2   3.0  666.0  ghi

In [165]:
df.fillna('100')

  col1 col2 col3
0    1  100  abc
1    2  555  def
2    3  666  ghi
3  100  444  xyz

In [69]:
help(df.fillna)

Help on method fillna in module pandas.core.frame:

fillna(value=None, method=None, axis=None, inplace=False, limit=None, downcast=None, **kwargs) method of pandas.core.frame.DataFrame instance
    Fill NA/NaN values using the specified method.

    Parameters
    ----------
    value : scalar, dict, Series, or DataFrame
        Value to use to fill holes (e.g. 0), alternately a
        dict/Series/DataFrame of values specifying which value to use for
        each index (for a Series) or column (for a DataFrame). (values not
        in the dict/Series/DataFrame will not be filled). This value cannot
        be a list.
    method : {'backfill', 'bfill', 'pad', 'ffill', None}, default None
        Method to use for filling holes in reindexed Series
        pad / ffill: propagate last valid observation forward to next valid
        backfill / bfill: use NEXT valid observation to fill gap
    axis : {0 or 'index', 1 or 'columns'}
    inplace : boolean, default False
        If True, fill in place. Note: this will modify any
        other views on this object, (e.g. a no-copy slice for a column in a
        DataFrame).
    limit : int, default None
        If method is specified, this is the maximum number of consecutive
        NaN values to forward/backward fill. In other words, if there is
        a gap with more than this number of consecutive NaNs, it will only
        be partially filled. If method is not specified, this is the
        maximum number of entries along the entire axis where NaNs will be
        filled. Must be greater than 0 if not None.
    downcast : dict, default is None
        a dict of item->dtype of what to downcast if possible,
        or the string 'infer' which will try to downcast to an appropriate
        equal type (e.g. float64 to int64 if possible)

    Returns
    -------
    filled : DataFrame

    See Also
    --------
    interpolate : Fill NaN values using interpolation.
    reindex, asfreq

    Examples
    --------
    >>> df = pd.DataFrame([[np.nan, 2, np.nan, 0],
    ...                    [3, 4, np.nan, 1],
    ...                    [np.nan, np.nan, np.nan, 5],
    ...                    [np.nan, 3, np.nan, 4]],
    ...                    columns=list('ABCD'))
    >>> df
         A    B   C  D
    0  NaN  2.0 NaN  0
    1  3.0  4.0 NaN  1
    2  NaN  NaN NaN  5
    3  NaN  3.0 NaN  4

    Replace all NaN elements with 0s.

    >>> df.fillna(0)
        A   B   C   D
    0   0.0 2.0 0.0 0
    1   3.0 4.0 0.0 1
    2   0.0 0.0 0.0 5
    3   0.0 3.0 0.0 4

    We can also propagate non-null values forward or backward.

    >>> df.fillna(method='ffill')
        A   B   C   D
    0   NaN 2.0 NaN 0
    1   3.0 4.0 NaN 1
    2   3.0 4.0 NaN 5
    3   3.0 3.0 NaN 4

    Replace all NaN elements in column 'A', 'B', 'C', and 'D', with 0, 1,
    2, and 3 respectively.

    >>> values = {'A': 0, 'B': 1, 'C': 2, 'D': 3}
    >>> df.fillna(value=values)
        A   B   C   D
    0   0.0 2.0 2.0 0
    1   3.0 4.0 2.0 1
    2   0.0 1.0 2.0 5
    3   0.0 3.0 2.0 4

    Only replace the first NaN element.

    >>> df.fillna(value=values, limit=1)
        A   B   C   D
    0   0.0 2.0 2.0 0
    1   3.0 4.0 NaN 1
    2   NaN 1.0 NaN 5
    3   NaN 3.0 NaN 4

In [166]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [167]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [168]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [169]:
pd.concat([df1,df2],axis=0)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [131]:
pd.concat([df1,df2],axis=1)

     A    B    C    D    A    B    C    D
0   A0   B0   C0   D0  NaN  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN  NaN
2   A2   B2   C2   D2  NaN  NaN  NaN  NaN
3   A3   B3   C3   D3  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN   A4   B4   C4   D4
5  NaN  NaN  NaN  NaN   A5   B5   C5   D5
6  NaN  NaN  NaN  NaN   A6   B6   C6   D6
7  NaN  NaN  NaN  NaN   A7   B7   C7   D7

In [170]:
df3 = pd.DataFrame({'E': ['E0', 'E1', 'E2', 'E3'],
                        'F': ['F0', 'F1', 'F2', 'F3'],
                        'G': ['G0', 'G1', 'G2', 'G3'],
                        'H': ['H0', 'H1', 'H2', 'H3']},
                        index=[0, 1, 2, 3])
df3

    E   F   G   H
0  E0  F0  G0  H0
1  E1  F1  G1  H1
2  E2  F2  G2  H2
3  E3  F3  G3  H3

In [171]:
pd.concat([df1,df3],axis=1)

    A   B   C   D   E   F   G   H
0  A0  B0  C0  D0  E0  F0  G0  H0
1  A1  B1  C1  D1  E1  F1  G1  H1
2  A2  B2  C2  D2  E2  F2  G2  H2
3  A3  B3  C3  D3  E3  F3  G3  H3

In [189]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K4'],
                          'C': ['C0', 'C1', 'C2', 'C4'],
                          'D': ['D0', 'D1', 'D2', 'D4']})

In [173]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [174]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K4  C4  D4

In [175]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2

In [176]:
pd.merge(left, right,how='outer', on=['key'])

  key    A    B    C    D
0  K0   A0   B0   C0   D0
1  K1   A1   B1   C1   D1
2  K2   A2   B2   C2   D2
3  K3   A3   B3  NaN  NaN
4  K4  NaN  NaN   C4   D4

In [177]:
pd.merge(left, right, how='right', on=['key'])

  key    A    B   C   D
0  K0   A0   B0  C0  D0
1  K1   A1   B1  C1  D1
2  K2   A2   B2  C2  D2
3  K4  NaN  NaN  C4  D4

In [178]:
pd.merge(left, right, how='left', on=['key'])

  key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K1  A1  B1   C1   D1
2  K2  A2  B2   C2   D2
3  K3  A3  B3  NaN  NaN

In [179]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['L0', 'L1', 'L0', 'L1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                      'key2': ['L0', 'L1', 'L0', 'L1'],
                         'C': ['C0', 'C1', 'C2', 'C3'],
                         'D': ['D0', 'D1', 'D2', 'D3']})

In [180]:
left

  key1 key2   A   B
0   K0   L0  A0  B0
1   K0   L1  A1  B1
2   K1   L0  A2  B2
3   K2   L1  A3  B3

In [181]:
right

  key1 key2   C   D
0   K0   L0  C0  D0
1   K1   L1  C1  D1
2   K1   L0  C2  D2
3   K2   L1  C3  D3

In [185]:
pd.merge(left, right,how='inner', on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   L0  A0  B0  C0  D0
1   K1   L0  A2  B2  C2  D2
2   K2   L1  A3  B3  C3  D3

In [183]:
pd.concat([left, right])

/home/gf/packages/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     A    B    C    D key1 key2
0   A0   B0  NaN  NaN   K0   L0
1   A1   B1  NaN  NaN   K0   L1
2   A2   B2  NaN  NaN   K1   L0
3   A3   B3  NaN  NaN   K2   L1
0  NaN  NaN   C0   D0   K0   L0
1  NaN  NaN   C1   D1   K1   L1
2  NaN  NaN   C2   D2   K1   L0
3  NaN  NaN   C3   D3   K2   L1

In [191]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [192]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [193]:
by_comp = df.groupby("Company")

In [194]:
by_comp

In [95]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [195]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [196]:
by_comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [197]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [198]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [80]:
# Save and load

In [199]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [200]:
df.to_csv('example.csv',index=False)

In [202]:
df = pd.read_csv('example.csv')

In [203]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz